---
layout: post
title:  "[2018 BISI-A] 코드론을 활용한 드론 자율 비행"
date:   2019-08-31 18:43:59
author: BISI-A
categories: BISI-A
tags:	BISI BISI-A CoDrone_Autopilot
cover:  "/assets/instacode.png"
---
#원리

##양력
양력은 말 그대로 기체를 위로 띄우는 힘을 말한다. 양력을 발생시키는 방법은 매우 많이 있지만 그중 대표적으로 2가지 방법이 있다. 첫 번째로는 공기의 경로의 길이의 차이에 따른 압력의 차이로 고기압에서 저기압으로 공기가 흐르는 성질을 이용해 기체를 띄우는 방식이 있다. 다른 하나는 날개를 비틀어 주행 시에 공기가 날개의 아랫면을 치게 되면 이 힘에 대한 반작용으로 기체를 띄우는 방식이 있다. 첫 번째 경우는 보통 비행기와 같은 고정익 방식의 기체를 만들 때에 많이 사용되고 두 번째 경우는 보통 헬기와 같은 회전익 방식의 기체에 많이 사용된다. 드론도 헬기와 마찬가지로 회전익 방식의 기체이므로 두 번째의 양력을 발생시키는 방식이 주를 이룬다.

##작용 반작용(뉴턴 제 3법칙)
작용, 반작용이란 힘이 작용할 때 그의 반대되는 방향으로(합력이 0이 되도록) 같은 크기의 힘이 작용하는 것을 말한다. 드론의 프로펠러는 대각선 방향을 한 쌍으로 두 쌍이 각각 반대 방향으로 회전한다. 그 이유는 만약 프로펠러가 시계방향으로만 회전한다면 이에 대한 반작용으로 기체는 시계 반대 방향으로 회전하게 된다. 이렇게 되면 기체를 제어할 수 없게 된다. 그렇기 때문에 대각선의 프로펠러가 한쌍을 이루어 쿼드콥터의 경우 2개는 CW, 2개는 CCW로 회전한다.

##관성
관성이란 물체가 운동 상태를 유지하려는 성질을 말한다. 드론의 자율비행동작을 컨트롤 할 때에는 관성을 특히 신경 써야 한다. 지면에서 움직이는 물체와 달리 드론은 공중에 있어 공기와의 마찰 빼고는 항력이 거의 발생하지 않는다. 따라서 거의 외력이 없는 상황이나 마찬가지이므로 관성을 고려하지 않고 코딩을 하게 되면 자신이 원하는 방향으로 기체를 날리지 못한다. 따라서 운동 관성을 잘 제어하여 코딩을 하여야 한다

#준비물
코드론, 노트북, 로킷 브릭 or 아두이노(robolink에서 배포한 버전으로 설치할 것)(robolinksw.com)

#실험 과정
##로킷 브릭을 활용하여 코딩을 하는 방법

##아두이노를 활용하여 코딩을 하는 방법

#결과

#결론

#유의사항

